In [1]:
import pandas as pd

ts = pd.read_csv("monthly_adjusted_IBM.csv")
ts = ts.sort_values(by="timestamp")
ts = ts.reset_index()
ts = ts.drop(columns="index")
ts

,timestamp,open,high,low,close,adjusted close,volume,dividend amount
0,1999-12-31,102.56,122.12,102.250,107.87,56.1783,158626300,0.00
1,2000-01-31,112.44,124.75,109.620,112.25,58.4594,175259600,0.00
2,2000-02-29,112.37,119.75,100.940,102.75,53.5659,133524400,0.12
3,2000-03-31,102.00,128.25,99.500,118.37,61.7090,194329000,0.00
4,2000-04-28,120.00,128.00,101.250,111.50,58.1275,168464800,0.00
...,...,...,...,...,...,...,...,...
287,2023-11-30,145.00,158.60,144.450,158.56,157.1450,78460252,1.66
288,2023-12-29,158.41,166.34,158.000,163.55,162.0905,87358302,0.00
289,2024-01-31,162.83,196.90,157.885,183.66,182.0211,128121557,0.00
290,2024-02-29,183.63,188.95,178.750,185.03,185.0300,88679550,1.66
291,2024-03-01,185.49,188.38,185.180,188.20,188.2000,4018354,0.00

In [2]:
df = pd.DataFrame({
    "timestamp": ts["timestamp"],
    "price": ts["adjusted close"],
    "dividend": ts["dividend amount"],
})
df

      timestamp     price  dividend
0    1999-12-31   56.1783      0.00
1    2000-01-31   58.4594      0.00
2    2000-02-29   53.5659      0.12
3    2000-03-31   61.7090      0.00
4    2000-04-28   58.1275      0.00
..          ...       ...       ...
287  2023-11-30  157.1450      1.66
288  2023-12-29  162.0905      0.00
289  2024-01-31  182.0211      0.00
290  2024-02-29  185.0300      1.66
291  2024-03-01  188.2000      0.00

[292 rows x 3 columns]

In [3]:
initial_investment = 1000000
yearly_sale_percentage = 0.04
capital_gains_tax = 0.26
dividend_tax = 0.26

In [4]:
bigmac_pricedata = pd.read_csv("bigmac.csv")
bigmac_pricedata

,date,currency_code,name,local_price,dollar_ex,dollar_price
0,2000-04-01,ARS,Argentina,2.50,1,2.50
1,2000-04-01,AUD,Australia,2.59,1,2.59
2,2000-04-01,BRL,Brazil,2.95,1,2.95
3,2000-04-01,GBP,Britain,1.90,1,1.90
4,2000-04-01,CAD,Canada,2.85,1,2.85
...,...,...,...,...,...,...
1941,2022-07-01,AED,United Arab Emirates,18.00,3,6.00
1942,2022-07-01,USD,United States,5.15,1,5.15
1943,2022-07-01,UYU,Uruguay,255.00,41,6.22
1944,2022-07-01,VES,Venezuela,10.00,5,2.00
1945,2022-07-01,VND,Vietnam,69000.00,23417,2.95

In [5]:
country = "United States"
bmprice = bigmac_pricedata[bigmac_pricedata.name == country][['date', 'dollar_price']]
bmprice['date'] = pd.to_datetime(bmprice['date'])
bmprice.rename(columns={"date": "timestamp", "dollar_price": "cpi"}, inplace=True)
df['timestamp'] = pd.to_datetime(df['timestamp'])
df = pd.merge_asof(df, bmprice, on="timestamp")

In [6]:
df

     timestamp     price  dividend   cpi
0   1999-12-31   56.1783      0.00   NaN
1   2000-01-31   58.4594      0.00   NaN
2   2000-02-29   53.5659      0.12   NaN
3   2000-03-31   61.7090      0.00   NaN
4   2000-04-28   58.1275      0.00  2.24
..         ...       ...       ...   ...
287 2023-11-30  157.1450      1.66  5.15
288 2023-12-29  162.0905      0.00  5.15
289 2024-01-31  182.0211      0.00  5.15
290 2024-02-29  185.0300      1.66  5.15
291 2024-03-01  188.2000      0.00  5.15

[292 rows x 4 columns]

In [7]:
df['cpi'] = df['cpi'].fillna(bmprice['cpi'].iloc[0])

In [8]:
df

     timestamp     price  dividend   cpi
0   1999-12-31   56.1783      0.00  2.24
1   2000-01-31   58.4594      0.00  2.24
2   2000-02-29   53.5659      0.12  2.24
3   2000-03-31   61.7090      0.00  2.24
4   2000-04-28   58.1275      0.00  2.24
..         ...       ...       ...   ...
287 2023-11-30  157.1450      1.66  5.15
288 2023-12-29  162.0905      0.00  5.15
289 2024-01-31  182.0211      0.00  5.15
290 2024-02-29  185.0300      1.66  5.15
291 2024-03-01  188.2000      0.00  5.15

[292 rows x 4 columns]

In [10]:
df['cpi'] = df['cpi'] / df['cpi'].iloc[0]

In [11]:
df

     timestamp     price  dividend       cpi
0   1999-12-31   56.1783      0.00  1.000000
1   2000-01-31   58.4594      0.00  1.000000
2   2000-02-29   53.5659      0.12  1.000000
3   2000-03-31   61.7090      0.00  1.000000
4   2000-04-28   58.1275      0.00  1.000000
..         ...       ...       ...       ...
287 2023-11-30  157.1450      1.66  2.299107
288 2023-12-29  162.0905      0.00  2.299107
289 2024-01-31  182.0211      0.00  2.299107
290 2024-02-29  185.0300      1.66  2.299107
291 2024-03-01  188.2000      0.00  2.299107

[292 rows x 4 columns]

In [12]:
df['shares'] = initial_investment / df['price'].iloc[0]

In [13]:
df

     timestamp     price  dividend       cpi       shares
0   1999-12-31   56.1783      0.00  1.000000  17800.46744
1   2000-01-31   58.4594      0.00  1.000000  17800.46744
2   2000-02-29   53.5659      0.12  1.000000  17800.46744
3   2000-03-31   61.7090      0.00  1.000000  17800.46744
4   2000-04-28   58.1275      0.00  1.000000  17800.46744
..         ...       ...       ...       ...          ...
287 2023-11-30  157.1450      1.66  2.299107  17800.46744
288 2023-12-29  162.0905      0.00  2.299107  17800.46744
289 2024-01-31  182.0211      0.00  2.299107  17800.46744
290 2024-02-29  185.0300      1.66  2.299107  17800.46744
291 2024-03-01  188.2000      0.00  2.299107  17800.46744

[292 rows x 5 columns]